type AboutDetail = string[];

export const aboutDetailData: AboutDetail = [
  '실제로 무엇인가를 만들면서 즐거움을 느끼는 일을 업으로 하고자 찾아 헤맸고, 프론트엔드 웹 개발을 시작했습니다. 저에게는 온전히 제 힘으로 무엇인가를 만든다는 점 그 자체가 즐겁고, 꾸준히 개발을 하게하는 원동력입니다.',
  'UI/UX 개선에 우선순위를 두고 있습니다. 사용자가 내가 완성한 서비스를 속에서 편리함과 즐거움을 찾아가면 좋겠다고 생각하며 이를 향상시키고자 고민합니다.',
  '단순한 기능 개발이 아닌 전체적인 서비스의 질적 향상을 위해 Figma, Notion, Jira 등 다양한 Tool를 활용하고, Clean Code, CI/CD, 최적화 등에 꾸준히 관심을 가지고 있습니다.',
  '피드백을 받는 것을 좋아합니다. 피드백과 코드리뷰를 기반으로 코드를 개선해 누구에게나 설명이 가능하고, 이해가 쉬운 코드를 작성하는 것을 목표로 하고 있습니다.',
  '보다 많은 사람들에게 지식을 공유하고, 함께 성장해나가는 것을 꿈꾸고 있습니다.',
];
